# DefinitionBindingMap Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMap Constructor
DefinitionBindingMap Class See Also
---
Initializes a new instance of the DefinitionBindingMap class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DefinitionBindingMap()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DefinitionBindingMap()
```

# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace